; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	infrared3 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 122)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 102)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 167)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 134)
	(= (data Phenomenon5 spectrograph0) 221)
	(= (data Star6 spectrograph0) 241)
	(= (data Phenomenon7 spectrograph0) 46)
	(= (data Phenomenon8 spectrograph0) 78)
	(= (data Planet9 spectrograph0) 118)
	(= (data Phenomenon5 spectrograph1) 130)
	(= (data Star6 spectrograph1) 212)
	(= (data Phenomenon7 spectrograph1) 140)
	(= (data Phenomenon8 spectrograph1) 147)
	(= (data Planet9 spectrograph1) 148)
	(= (data Phenomenon5 thermograph2) 95)
	(= (data Star6 thermograph2) 119)
	(= (data Phenomenon7 thermograph2) 252)
	(= (data Phenomenon8 thermograph2) 135)
	(= (data Planet9 thermograph2) 248)
	(= (data Phenomenon5 infrared3) 234)
	(= (data Star6 infrared3) 83)
	(= (data Phenomenon7 infrared3) 214)
	(= (data Phenomenon8 infrared3) 191)
	(= (data Planet9 infrared3) 116)
	(= (slew_time GroundStation2 GroundStation0) 42.03)
	(= (slew_time GroundStation0 GroundStation2) 42.03)
	(= (slew_time GroundStation2 GroundStation1) 28.32)
	(= (slew_time GroundStation1 GroundStation2) 28.32)
	(= (slew_time Star3 GroundStation0) 83.95)
	(= (slew_time GroundStation0 Star3) 83.95)
	(= (slew_time Star3 GroundStation1) 52.98)
	(= (slew_time GroundStation1 Star3) 52.98)
	(= (slew_time Star3 GroundStation2) 38.97)
	(= (slew_time GroundStation2 Star3) 38.97)
	(= (slew_time GroundStation4 GroundStation0) 0.3661)
	(= (slew_time GroundStation0 GroundStation4) 0.3661)
	(= (slew_time GroundStation4 GroundStation1) 81.62)
	(= (slew_time GroundStation1 GroundStation4) 81.62)
	(= (slew_time GroundStation4 GroundStation2) 71.39)
	(= (slew_time GroundStation2 GroundStation4) 71.39)
	(= (slew_time GroundStation4 Star3) 62.57)
	(= (slew_time Star3 GroundStation4) 62.57)
	(= (slew_time GroundStation1 GroundStation0) 9.864)
	(= (slew_time GroundStation0 GroundStation1) 9.864)
	(= (slew_time Phenomenon5 GroundStation0) 17.78)
	(= (slew_time GroundStation0 Phenomenon5) 17.78)
	(= (slew_time Phenomenon5 GroundStation1) 25.53)
	(= (slew_time GroundStation1 Phenomenon5) 25.53)
	(= (slew_time Phenomenon5 GroundStation2) 66.49)
	(= (slew_time GroundStation2 Phenomenon5) 66.49)
	(= (slew_time Phenomenon5 Star3) 42.58)
	(= (slew_time Star3 Phenomenon5) 42.58)
	(= (slew_time Phenomenon5 GroundStation4) 59.93)
	(= (slew_time GroundStation4 Phenomenon5) 59.93)
	(= (slew_time Star6 GroundStation0) 89.61)
	(= (slew_time GroundStation0 Star6) 89.61)
	(= (slew_time Star6 GroundStation1) 82.08)
	(= (slew_time GroundStation1 Star6) 82.08)
	(= (slew_time Star6 GroundStation2) 6.907)
	(= (slew_time GroundStation2 Star6) 6.907)
	(= (slew_time Star6 Star3) 2.62)
	(= (slew_time Star3 Star6) 2.62)
	(= (slew_time Star6 GroundStation4) 45.06)
	(= (slew_time GroundStation4 Star6) 45.06)
	(= (slew_time Star6 Phenomenon5) 2.544)
	(= (slew_time Phenomenon5 Star6) 2.544)
	(= (slew_time Phenomenon7 GroundStation0) 54.82)
	(= (slew_time GroundStation0 Phenomenon7) 54.82)
	(= (slew_time Phenomenon7 GroundStation1) 22.96)
	(= (slew_time GroundStation1 Phenomenon7) 22.96)
	(= (slew_time Phenomenon7 GroundStation2) 11.64)
	(= (slew_time GroundStation2 Phenomenon7) 11.64)
	(= (slew_time Phenomenon7 Star3) 36)
	(= (slew_time Star3 Phenomenon7) 36)
	(= (slew_time Phenomenon7 GroundStation4) 37.49)
	(= (slew_time GroundStation4 Phenomenon7) 37.49)
	(= (slew_time Phenomenon7 Phenomenon5) 19.2)
	(= (slew_time Phenomenon5 Phenomenon7) 19.2)
	(= (slew_time Phenomenon7 Star6) 10.48)
	(= (slew_time Star6 Phenomenon7) 10.48)
	(= (slew_time Phenomenon8 GroundStation0) 92.38)
	(= (slew_time GroundStation0 Phenomenon8) 92.38)
	(= (slew_time Phenomenon8 GroundStation1) 8.45)
	(= (slew_time GroundStation1 Phenomenon8) 8.45)
	(= (slew_time Phenomenon8 GroundStation2) 23.07)
	(= (slew_time GroundStation2 Phenomenon8) 23.07)
	(= (slew_time Phenomenon8 Star3) 36.46)
	(= (slew_time Star3 Phenomenon8) 36.46)
	(= (slew_time Phenomenon8 GroundStation4) 67.82)
	(= (slew_time GroundStation4 Phenomenon8) 67.82)
	(= (slew_time Phenomenon8 Phenomenon5) 7.259)
	(= (slew_time Phenomenon5 Phenomenon8) 7.259)
	(= (slew_time Phenomenon8 Star6) 11.78)
	(= (slew_time Star6 Phenomenon8) 11.78)
	(= (slew_time Phenomenon8 Phenomenon7) 41.55)
	(= (slew_time Phenomenon7 Phenomenon8) 41.55)
	(= (slew_time Planet9 GroundStation0) 7.571)
	(= (slew_time GroundStation0 Planet9) 7.571)
	(= (slew_time Planet9 GroundStation1) 21.86)
	(= (slew_time GroundStation1 Planet9) 21.86)
	(= (slew_time Planet9 GroundStation2) 61.82)
	(= (slew_time GroundStation2 Planet9) 61.82)
	(= (slew_time Planet9 Star3) 52.51)
	(= (slew_time Star3 Planet9) 52.51)
	(= (slew_time Planet9 GroundStation4) 78.85)
	(= (slew_time GroundStation4 Planet9) 78.85)
	(= (slew_time Planet9 Phenomenon5) 25.28)
	(= (slew_time Phenomenon5 Planet9) 25.28)
	(= (slew_time Planet9 Star6) 59.98)
	(= (slew_time Star6 Planet9) 59.98)
	(= (slew_time Planet9 Phenomenon7) 20.58)
	(= (slew_time Phenomenon7 Planet9) 20.58)
	(= (slew_time Planet9 Phenomenon8) 2.462)
	(= (slew_time Phenomenon8 Planet9) 2.462)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon5 spectrograph0)
	(have_image Phenomenon7 spectrograph0)
	(have_image Phenomenon8 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 phenomenon8 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 167 to 99.18, (fuel-used) from 0 to 67.82
   goals met: 0 of 3
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
3. (turn_to satellite0 phenomenon7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 122 to 102.8, (fuel-used) from 67.82 to 87.02
   goals met: 0 of 3
4. (turn_to satellite2 groundstation0 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 99.18 to 6.8, (fuel-used) from 87.02 to 179.4
   goals met: 0 of 3
5. (turn_to satellite1 star6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 102 to 99.456, (fuel-used) from 179.4 to 181.944
   goals met: 0 of 3
6. (turn_to satellite1 phenomenon5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 99.456 to 96.912, (fuel-used) from 181.944 to 184.488
   goals met: 0 of 3
7. (turn_to satellite1 star6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 96.912 to 94.368, (fuel-used) from 184.488 to 187.032
   goals met: 0 of 3
8. (turn_to satellite1 phenomenon5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 94.368 to 91.824, (fuel-used) from 187.032 to 189.576
   goals met: 0 of 3
9. (turn_to satellite1 star6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 91.824 to 89.28, (fuel-used) from 189.576 to 192.12
   goals met: 0 of 3
10. (turn_to satellite1 phenomenon5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 89.28 to 86.736, (fuel-used) from 192.12 to 194.664
   goals met: 0 of 3
11. (turn_to satellite1 phenomenon8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 86.736 to 79.477, (fuel-used) from 194.664 to 201.923
   goals met: 0 of 3
12. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 79.477 to 72.218, (fuel-used) from 201.923 to 209.182
   goals met: 0 of 3
13. (turn_to satellite1 phenomenon8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 72.218 to 64.959, (fuel-used) from 209.182 to 216.441
   goals met: 0 of 3
14. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 64.959 to 57.7, (fuel-used) from 216.441 to 223.7
   goals met: 0 of 3
15. (turn_to satellite1 groundstation0 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 57.7 to 39.92, (fuel-used) from 223.7 to 241.48
   goals met: 0 of 3
16. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 3
17. (turn_to satellite1 phenomenon5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 39.92 to 22.14, (fuel-used) from 241.48 to 259.26
   goals met: 0 of 3
18. (turn_to satellite1 phenomenon8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 22.14 to 14.881, (fuel-used) from 259.26 to 266.519
   goals met: 0 of 3
19. (take_image satellite1 phenomenon8 instrument1 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   changed: (data_capacity satellite1) from 1000 to 853, (data-stored) from 0 to 147
   goals met: 1 of 3
20. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 14.881 to 7.622, (fuel-used) from 266.519 to 273.778
   goals met: 1 of 3
21. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 3
22. (turn_to satellite0 groundstation0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 102.8 to 47.98, (fuel-used) from 273.778 to 328.598
   goals met: 1 of 3
23. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 3
24. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 47.98 to 40.409, (fuel-used) from 328.598 to 336.169
   goals met: 1 of 3
25. (turn_to satellite0 phenomenon7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 40.409 to 19.829, (fuel-used) from 336.169 to 356.749
   goals met: 1 of 3
26. (take_image satellite1 phenomenon5 instrument1 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   changed: (data_capacity satellite1) from 853 to 632, (data-stored) from 147 to 368
   goals met: 2 of 3
27. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   changed: (data_capacity satellite0) from 1000 to 954, (data-stored) from 368 to 414
   goals met: 3 of 3
